app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("title", "weight", "products_counter", "created_at", "updated_at", "ancestry") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test33"], ["weight", 0], ["products_counter", 0], ["created_at", "2023-07-20 15:50:18.442894"], ["updated_at", "2023-07-20 15:50:18.442894"], ["ancestry", "1"]]
---
  def create
    @category = Category.new(params.require(:category).permit!)
    if @category.save