app/controllers/sessions_controller.rb

UPDATE "users" SET "remember_me_token" = ?, "remember_me_token_expires_at" = ? WHERE "users"."id" = ?  [["remember_me_token", nil], ["remember_me_token_expires_at", nil], ["id", 2]]
---
    def create
       if user = login(params[:email],params[:password])
        # 更新购物车数量 如果用户存在该商品的话就直接覆盖,没有就是新增
        user_shopping_carts = ShoppingCart.where(user_uuid: user.uuid)
        anonymous_shopping_carts = ShoppingCart.where(user_uuid: session[:user_uuid])
        anonymous_shopping_carts.each do |cart|
            # 如果包含该商品就直接覆盖数量
            user_cart =  user_shopping_carts.find { |user_cart| user_cart.product == cart.product }
            if user_cart
                user_cart.destroy
            end
            cart.update(user_uuid: user.uuid)