app/controllers/users_controller.rb

    def create
        @user = User.new(params.require(:user).permit(:email,:password,:password_confirmation))
        @user.uuid = session[:user_uuid]
        if @user.save
---
INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at", "activation_state", "activation_token", "activation_token_expires_at", "remember_me_token", "remember_me_token_expires_at", "reset_password_token", "reset_password_token_expires_at", "reset_password_email_sent_at", "access_count_to_reset_password_page") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)